app/Controllers/Produk.php

            $foto_barang->move('img', $namapoto);
        }

        $this->ModelProduct->save([
            'nama_barang' => $this->request->getVar('namabarang'),
            'harga_beli' => $this->request->getVar('hargabeli'),
            'harga_jual' => $this->request->getVar('hargajual'),
            'stok_barang' => $this->request->getVar('stok'),
            'foto_barang' => $namapoto,
            'kategori_produk' => $this->request->getVar('kategori'),
        ]);
---
INSERT INTO `t_produk` (`nama_barang`, `harga_beli`, `harga_jual`, `stok_barang`, `foto_barang`, `kategori_produk`, `created_at`, `updated_at`) VALUES ('Raket', '150000', '200000', '11', '1710688865_ea57b079552bb5b46c15.jpg', 'olahraga', '2024-03-17 15:21:05', '2024-03-17 15:21:05')