app/Models/ModelCat.php

SELECT *
FROM `t_kategori`
---
    public function AllData()
    {
        return $this->db->table('t_kategori')
            ->get()
            ->getResultArray();