app/Models/ModelLogin.php

    public function LoginUser($username, $password)
    {
        return $this->db->table('t_user')
            ->where([
                'user_name' => $username,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `t_user`
WHERE `user_name` = 'mufid'
AND `password` = '12345'