app/Models/ModelProduct.php

    public function AllData()
    {
        return $this->db->table('t_produk')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `t_produk`